arturoriegaore/ESP32S3_TDV_ESTAMPADO_SALVADE_PRUEBA_SERVER_BD_WEB/src/main.cpp
#include <WiFi.h>
#include <Wire.h>
#include <RTClib.h>
#include <SPI.h>       
#include <Arduino.h>
#include "freertos/queue.h"
#include <Bounce2.h>    
#include <ESP32Time.h>  
#include <HTTPClient.h>  
#include <ArduinoJson.h> 
#include <FS.h>
#include <LittleFS.h>
#include <esp_system.h>  

///////!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"""""""""""""""""""22221111111111111111111"
/*--------VERIFICAR DATOS----------*/
/*





//falta el codigo en el .ini de littlefs

//falta volver a la normalidad para no ver mensajes de depuracion

//ste codigo envia el conteo de el pin10 cuando para el star(in1), esta bien para matzuyas pero borrr para el resto

       SSID
       PASSWORD
       IP
       GATEWAY
       SUBNET
       DNS 1
       DNS 2

       URL DE LA API

       IP DEL SERVIDOR NTP

       CODIGO DE MAQUINA
      
       INTERVALO DE TIEMPO DE ENVIO DESDE LITTLEFS

       HOSTNAME DEL EQUIPO   EJEMPLO : DeviceTejRecR609





*/


/*--------ACTIVAR/DESACTIVAR DEPURACION----------*/
#define DEBUG_CMD "starship"  // Codigo de acceso
bool debugEnabled = true;  // Habilita/Deshabilita depuracion   //dejarlo en false
#define DEBUG_PRINT(x)  if(debugEnabled) { Serial.print(x); }
#define DEBUG_PRINTLN(x)  if(debugEnabled) { Serial.println(x); }


/*--------IMPUT DIGITAL----------*/ //Tarj. Matzuya M.  out:  33, start :  23,  conteo:   35
#define IN1 1                                           //PRODUCCION   
#define IN2 2                                           //PARO MANUAL
#define IN3 4                                           //HILO LATERAL
#define IN4 5                                           //HILO SUPERIOR
#define IN5 6                                           //LYCRA
#define IN6 7                                           //CAIDA DE TELA
#define IN7 8                                           //ANTIRREMOTADA
#define IN8 9                                           //FIN DE PIEZA O RPM
#define IN9 10                                          //PUERTA
#define IN10 11                                         //CONTEO

/*--------OUTPUT RELAY----------*/                                    
#define RL1 12                                          
#define RL2 13                                           
#define RL3 14 

/*--------LEDS INDICADORES----------*/
#define LEDWIFI 21 
#define LEDRTC 38 

/*--------I2C PARA DS3231----------*/
#define SDA_PIN 17
#define SCL_PIN 18

#define MAX_ATTEMPTS 10 //NUMERO DE INTENTOS PARA INICIAR DS3231 POR I2C


/*--------SERVIDOR NTP----------*/
const char* ntpServer = "192.168.239.161";         //Servidor NTP TDV 131.107.32.217 
const long gmtOffset_sec = -5*3600;                //Desplazamiento GMT
const int daylightOffset_sec = 0;                  //Compensacion de luz diurna
ESP32Time rtc_esp32;


RTC_DS3231 rtc_ds3231;

DateTime now; //variable global para definir now que luego se usara para alamcenar el tiempo


// Función que devuelve la fecha y la hora actual del RTC en formato (YYYYMMDDTHHMMSS)
String getDateTimeCodeDS3231() {

now = rtc_ds3231.now(); //Actualiza el tiempo en now desde DS3231 para usarlo en getDateTimeCodeDS3231() y getDateTimeDS3231()

  char buf[64];
  sprintf(buf, "%04d%02d%02d%02d%02d%02d", now.year(), now.month(), now.day(), now.hour(), now.minute(), now.second());
  return String(buf);
}

// Función que devuelve la fecha y la hora actual del RTC en formato ISO 8601 (YYYY-MM-DDTHH:MM:SS)
String getDateTimeDS3231() {
now = rtc_ds3231.now();
//DateTime now = rtc_ds3231.now();
  // Crear una cadena para almacenar la fecha y la hora formateada
  char buf[64];

  // Formatear la fecha y la hora y guardarla en la cadena creada
  sprintf(buf, "%04d-%02d-%02dT%02d:%02d:%02d", now.year(), now.month(), now.day(), now.hour(), now.minute(), now.second());

  // Devolver la cadena con la fecha y la hora formateada
  return String(buf);
}



/*--------ALARMA DE NO CONFIGURACION DE TIEMPO DS3231, INTERVALO PARDADEO LED----------*/ 
unsigned long previousMillis_led_rtc = 0; 
const long interval_led_rtc = 250; // Intervalo de parpadeo en milisegundos para alarma


/*--------TIEMPO DE ESPERA PARA EJECUTAR CONFIGURACION SERVIDOR NTP----------*/
unsigned long startTimeoutForNTP = 0; 
bool timeoutOver = false; // Para saber si ya pasó el tiempo de espera


/*--------FUNCIONES QUE SE EJECUTAN UNA SOLA VEZ----------*/
bool funcionYaEjecutada = false;
bool funcionYaEjecutada2 = false;

bool ledStatus = false;


/*--------FUNCION PARA ALARMA DE NO CONFIGURACION DE TIMEPO DS3231----------*/
void updateLedStatusRTC() {
  unsigned long currentMillis_led_rtc = millis(); // Obtiene el tiempo actual
  if (currentMillis_led_rtc - previousMillis_led_rtc >= interval_led_rtc) {
    previousMillis_led_rtc = currentMillis_led_rtc;
   if (digitalRead(LEDRTC) == LOW) {
       digitalWrite(LEDRTC, HIGH);
   } else {
    digitalWrite(LEDRTC, LOW);
    }
  }
}

/*--------FUNCION PARA EJECUTAR CONFIGURACION DE SERVIDOR NTP----------*/
void runSetupServerNTP() {
  if (!funcionYaEjecutada) {
    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
	Serial.print("\n\n\nActualizando tiempo en ESP32 desde servidor NTP");
  startTimeoutForNTP = millis(); // Guarda el tiempo de inicio del programa
    funcionYaEjecutada = true;
  }
}

/*--------FUNCION PARA CONFIGURAR TIEMPO EN EL DS3231----------*/
void updateTimeDevice() {
  if (!funcionYaEjecutada2) {
    if (rtc_esp32.getYear() > 2022) { 
	 rtc_ds3231.adjust(DateTime(rtc_esp32.getYear(), rtc_esp32.getMonth()+1, rtc_esp32.getDay(), rtc_esp32.getHour(true), rtc_esp32.getMinute(), rtc_esp32.getSecond()));
     Serial.print("\n\nConfigurando DS3231 :  "); 
     Serial.print(rtc_esp32.getTime("%A, %B %d %Y %H:%M:%S"));
	 if(rtc_ds3231.now().year() > 2022){
    Serial.print("\n\nDS3231 Configurado desde ESP32"); 
	funcionYaEjecutada2 = true;
	timeoutOver = true; // Ya no necesitamos seguir comprobando
  digitalWrite(LEDRTC, LOW);
    if (ledStatus) {digitalWrite(LEDRTC, HIGH);} 
	return;	
	    }else{
        Serial.println("\n\nFalla al configurar el DS3231 desde ESP32");
      }
    }
  if(rtc_ds3231.now().year() > 2022){
    Serial.println("\n\nDS3231 Ya se encuentra Configurado"); 
	funcionYaEjecutada2 = true;	
	timeoutOver = true; // Ya no necesitamos seguir comprobando
  return;	
	}

