arturoriegaore/ESP32S3_TDV_ESTAMPADO_SALVADE_PRUEBA_SERVER_BD_WEB/src/main.cpp
   if (responseCode < 0)
   {
    DEBUG_PRINT("\n\n         Error al intentar enviar Post Request");
    http.end();
   }

   if (responseCode != 200)
   {
    DEBUG_PRINT("\n\n         Error en response al intentar enviar :  ");
    DEBUG_PRINTLN(responseCode);
    http.end();
    appendDataToFile(json.as<String>());  //agrega el dato que no se envio al archivo data.text
   }

   if (responseCode == 200)
   {
    String responseBody = http.getString();
    DEBUG_PRINT("\n\nDatos enviados :  ");
    DEBUG_PRINTLN(json.as<String>());
 
    //deserializeJson(apiResponse, responseBody);    //deserializa una cadena JSON
    //delay(2000);
    //String codigoresponse = apiResponse["codUnicoParo"]; // retorna  por (codigoresponse)  el {"CodUnicoParo":"20230322085824"}
    //Serial.println(codigoresponse);
    //Serial.println(responseBody);"

    http.end();
    

    }
      count = 0;
  } 
        
 else
        
 {

  //JSON  A ENVIAR POR POST
    json.clear();                                                              
    json["CodMaquina"] = codMaquina,                 
    json["CodParo"] = codParoIN1,                   
    json["CodUnicoParo"] = codStaticIN1,          
    json["FechaHoraIniParo"] = "",     
    json["FechaHoraFinParo"] = getDateTimeDS3231(),   //rtc_esp32.getTime("%FT%T"),            
    json["Rpm"] = count,                                      

    //HTTP POST
   http.begin(url_api);   
   http.addHeader("Content-Type", "application/json"); 

   int responseCode = http.POST(json.as<String>());

   if (responseCode < 0)
   {
    DEBUG_PRINT("\n\n         Error al intentar enviar Post Request");
    http.end();
   }

   if (responseCode != 200)
   {
    DEBUG_PRINT("\n\n         Error en response al intentar enviar :  ");
    DEBUG_PRINTLN(responseCode);
    http.end();
    appendDataToFile(json.as<String>());  //agrega el dato que no se envio al archivo data.text
   }

   if (responseCode == 200)
   {
    String responseBody = http.getString();
    DEBUG_PRINT("\n\nDatos enviados :  ");
    DEBUG_PRINTLN(json.as<String>());
 
    //deserializeJson(apiResponse, responseBody);    //deserializa una cadena JSON
    //delay(2000);
    //String codigoresponse = apiResponse["codUnicoParo"]; // retorna  por (codigoresponse)  el {"CodUnicoParo":"20230322085824"}
    //Serial.println(codigoresponse);
    //Serial.println(responseBody);"

    http.end();

      }

      codStaticIN1 = "";
      count = 0;
   
    }
     
  }

  
 /*-------------------------DIGITAL IMPUT 2---------------------------*/
  if(info.pin == IN2)

  {
     static String  codStaticIN2 = "";

        if(info.state == HIGH) 

        {  codStaticIN2 = getDateTimeCodeDS3231();  //rtc_esp32.getTime("%Y%m%d%H%M%S");  // Actualizar el código cuando PIN1 esté en alto
 
  //JSON  A ENVIAR POR POST
    json.clear();                                                        
    json["CodMaquina"] = codMaquina,                  
    json["CodParo"] = codParoIN2,                    
    json["CodUnicoParo"] = codStaticIN2,          
    json["FechaHoraIniParo"] = getDateTimeDS3231(),   //rtc_esp32.getTime("%FT%T"),         
    json["FechaHoraFinParo"] = "",          
    json["Rpm"] = 0,                                      

   //HTTP POST
   http.begin(url_api);   
   http.addHeader("Content-Type", "application/json"); 

   int responseCode = http.POST(json.as<String>());

   if (responseCode < 0)
   {
    DEBUG_PRINT("\n\n         Error al intentar enviar Post Request");
    http.end();
   }

   if (responseCode != 200)
   {
    DEBUG_PRINT("\n\n         Error en response al intentar enviar :  ");
    DEBUG_PRINTLN(responseCode);
    http.end();
    appendDataToFile(json.as<String>());  //agrega el dato que no se envio al archivo data.text
   }

   if (responseCode == 200)
   {
    String responseBody = http.getString();
    DEBUG_PRINT("\n\nDatos enviados :  ");
    DEBUG_PRINTLN(json.as<String>());
 
    //deserializeJson(apiResponse, responseBody);    //deserializa una cadena JSON
    //delay(2000);
    //String codigoresponse = apiResponse["codUnicoParo"]; // retorna  por (codigoresponse)  el {"CodUnicoParo":"20230322085824"}
    //Serial.println(codigoresponse);
    //Serial.println(responseBody);"

    http.end();
    

    }
     
  } 
        
 else
        
 {

  //JSON  A ENVIAR POR POST
    json.clear();                                                              
    json["CodMaquina"] = codMaquina,                 
    json["CodParo"] = codParoIN2,                   
    json["CodUnicoParo"] = codStaticIN2,          
    json["FechaHoraIniParo"] = "",     
    json["FechaHoraFinParo"] = getDateTimeDS3231(),   //rtc_esp32.getTime("%FT%T"),            
    json["Rpm"] = 0,                                      

    //HTTP POST
   http.begin(url_api);   
   http.addHeader("Content-Type", "application/json"); 

   int responseCode = http.POST(json.as<String>());

   if (responseCode < 0)
   {
    DEBUG_PRINT("\n\n         Error al intentar enviar Post Request");
    http.end();
   }

   if (responseCode != 200)
   {
    DEBUG_PRINT("\n\n         Error en response al intentar enviar :  ");
    DEBUG_PRINTLN(responseCode);
    http.end();
    appendDataToFile(json.as<String>());  //agrega el dato que no se envio al archivo data.text
   }

   if (responseCode == 200)
   {
    String responseBody = http.getString();
    DEBUG_PRINT("\n\nDatos enviados :  ");
    DEBUG_PRINTLN(json.as<String>());
 
    //deserializeJson(apiResponse, responseBody);    //deserializa una cadena JSON
    //delay(2000);
    //String codigoresponse = apiResponse["codUnicoParo"]; // retorna  por (codigoresponse)  el {"CodUnicoParo":"20230322085824"}
    //Serial.println(codigoresponse);
    //Serial.println(responseBody);"

    http.end();

      }

      codStaticIN2 = "";
   
    }
     
  }

  

 /*-------------------------DIGITAL IMPUT 3---------------------------*/
  if(info.pin == IN3)

  {
     static String  codStaticIN3 = "";

        if(info.state == LOW) 

        {  codStaticIN3 = getDateTimeCodeDS3231();  //rtc_esp32.getTime("%Y%m%d%H%M%S");  // Actualizar el código cuando PIN1 esté en alto
 
  //JSON  A ENVIAR POR POST
    json.clear();                                                        
    json["CodMaquina"] = codMaquina,                  
    json["CodParo"] = codParoIN3,                    
    json["CodUnicoParo"] = codStaticIN3,          
    json["FechaHoraIniParo"] = getDateTimeDS3231(),   //rtc_esp32.getTime("%FT%T"),         
    json["FechaHoraFinParo"] = "",          
    json["Rpm"] = 0,                                      

   //HTTP POST
   http.begin(url_api);   
   http.addHeader("Content-Type", "application/json"); 

   int responseCode = http.POST(json.as<String>());

