arturoriegaore/ESP32S3_TDV_ESTAMPADO_SALVADE_PRUEBA_SERVER_BD_WEB/src/main.cpp
   if (responseCode < 0)
   {
    DEBUG_PRINT("\n\n         Error al intentar enviar Post Request");
    http.end();
   }

   if (responseCode != 200)
   {
    DEBUG_PRINT("\n\n         Error en response al intentar enviar :  ");
    DEBUG_PRINTLN(responseCode);
    http.end();
    appendDataToFile(json.as<String>());  //agrega el dato que no se envio al archivo data.text
   }

   if (responseCode == 200)
   {
    String responseBody = http.getString();
    DEBUG_PRINT("\n\nDatos enviados :  ");
    DEBUG_PRINTLN(json.as<String>());
 
    //deserializeJson(apiResponse, responseBody);    //deserializa una cadena JSON
    //delay(2000);
    //String codigoresponse = apiResponse["codUnicoParo"]; // retorna  por (codigoresponse)  el {"CodUnicoParo":"20230322085824"}
    //Serial.println(codigoresponse);
    //Serial.println(responseBody);"

    http.end();
    

    }
     
  } 
        
 else
        
 {

  //JSON  A ENVIAR POR POST
    json.clear();                                                              
    json["CodMaquina"] = codMaquina,                 
    json["CodParo"] = codParoIN3,                   
    json["CodUnicoParo"] = codStaticIN3,          
    json["FechaHoraIniParo"] = "",     
    json["FechaHoraFinParo"] = getDateTimeDS3231(),   //rtc_esp32.getTime("%FT%T"),            
    json["Rpm"] = 0,                                      

    //HTTP POST
   http.begin(url_api);   
   http.addHeader("Content-Type", "application/json"); 

   int responseCode = http.POST(json.as<String>());

   if (responseCode < 0)
   {
    DEBUG_PRINT("\n\n         Error al intentar enviar Post Request");
    http.end();
   }

   if (responseCode != 200)
   {
    DEBUG_PRINT("\n\n         Error en response al intentar enviar :  ");
    DEBUG_PRINTLN(responseCode);
    http.end();
    appendDataToFile(json.as<String>());  //agrega el dato que no se envio al archivo data.text
   }

   if (responseCode == 200)
   {
    String responseBody = http.getString();
    DEBUG_PRINT("\n\nDatos enviados :  ");
    DEBUG_PRINTLN(json.as<String>());
 
    //deserializeJson(apiResponse, responseBody);    //deserializa una cadena JSON
    //delay(2000);
    //String codigoresponse = apiResponse["codUnicoParo"]; // retorna  por (codigoresponse)  el {"CodUnicoParo":"20230322085824"}
    //Serial.println(codigoresponse);
    //Serial.println(responseBody);"

    http.end();

      }

      codStaticIN3 = "";
   
    }
     
  }

  



























  }

}




/*-------------------------SE EJECUTA CADA X INTERVALO DE TIEMPO PARA ENVIAR DESDE LITTLEFS---------------------------*/  
 unsigned long currentTime1 = millis();
  if (currentTime1 - previousTime1 >= interval1) 
  {  previousTime1 = currentTime1;
   sendDataFromLittleFS(); 
  }






/*--------SERIALS PRINTS PARA MOSTARA EN CONSOLA----------*/
/*
  
  Serial.print("Dirección IP: ");
  Serial.println(WiFi.localIP());
  Serial.print("Máscara de subred: ");
  Serial.println(WiFi.subnetMask());
  Serial.print("Puerta de enlace: ");
  Serial.println(WiFi.gatewayIP());
  Serial.print("Dirección IP del servidor DNS 1: ");
  Serial.println(WiFi.dnsIP(0));
  Serial.print("Dirección IP del servidor DNS 2: ");
  Serial.println(WiFi.dnsIP(1));

  Serial.print("Intensidad de la señal Wi-Fi (RSSI): ");
  Serial.print(WiFi.RSSI());
  Serial.println(" dBm");

  Serial.print("\n\n\nEnviando JSON.......");
  Serial.println(json.as<String>());

  Serial.print("\n         Tiempo Servidor NTP  -> ");
  Serial.print(rtc_esp32.getTime("%Y%m%d%H%M%S"));

  size_t freeHeap = ESP.getFreeHeap();
  Serial.print("Memoria libre: ");
  Serial.print(freeHeap);
  Serial.println(" bytes");
  
  Serial.print("Velocidad del procesador: ");
  Serial.print(ESP.getCpuFreqMHz());
  Serial.println(" MHz");

  Serial.print("Almacenamiento flash total (bytes): ");
  Serial.println(ESP.getFlashChipSize());
  Serial.print("Almacenamiento flash usado (bytes): ");
  Serial.println(ESP.getSketchSize());

  Serial.print("Espacio total en LittleFS: ");
  Serial.print(LittleFS.totalBytes() / (1024.0 * 1024.0));
  Serial.println(" MB");

  Serial.print("Espacio usado en LittleFS: ");
  Serial.print(LittleFS.usedBytes() / (1024.0 * 1024.0));
  Serial.println(" MB");

  Serial.print("Espacio libre en LittleFS: ");
  Serial.print((LittleFS.totalBytes() - LittleFS.usedBytes()) / (1024.0 * 1024.0));
  Serial.println(" MB");
  

*/




  /*--------PRUEBA - RELE CONTADOR ACTIVACIONES CADA X TIEMPO ----------*/
/*
 if (count_prueba < 300) {    //Numero de activaciones 
  static unsigned long previousMillis = 0;
  unsigned long currentMillis = millis();
  if (currentMillis - previousMillis >= 500) {   //Tiempo de duracion de cada activacion
    previousMillis = currentMillis;
    digitalWrite(RL3, !digitalRead(RL3));
     count_prueba++;}
 }

*/






/*--------PRUEBA - ENVIO DE CREDENCIALES WIFI POST ----------*/
/*
 unsigned long currentTime2 = millis();
  if (currentTime2 - previousTime2 >= interval2) 
  {  previousTime2 = currentTime2;

    if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  
  //JSON  A ENVIAR POR POST
    json.clear();                                                        
    json["CodMaquina"] = wifi_ssid,                  
    json["CodParo"] = wifi_password,                    
    json["CodUnicoParo"] = local_IP,          
    json["FechaHoraIniParo"] = "",         
    json["FechaHoraFinParo"] = "",            
    json["Rpm"] = timeupdatewifi,                                      

   //HTTP POST
   http.begin(url_api);   
   http.addHeader("Content-Type", "application/json"); 

   int responseCode = http.POST(json.as<String>());

   if (responseCode < 0)
   {
    DEBUG_PRINT("\n\n         Error al intentar enviar Post Request wifi");
    http.end();
   }

   if (responseCode != 200)
   {
    DEBUG_PRINT("\n\n         Error en response al intentar enviar credenciales wifi:  ");
    DEBUG_PRINTLN(responseCode);
    http.end();
    //appendDataToFile(json.as<String>());  //agrega el dato que no se envio al archivo data.text

   }

   if (responseCode == 200)
   {
    String responseBody = http.getString();
    DEBUG_PRINT("\n\nDatos wifi enviados :  ");
    DEBUG_PRINTLN(json.as<String>());
 
    //deserializeJson(apiResponse, responseBody);    //deserializa una cadena JSON
    //delay(2000);
    //String codigoresponse = apiResponse["codUnicoParo"]; // retorna  por (codigoresponse)  el {"CodUnicoParo":"20230322085824"}
    //Serial.println(codigoresponse);
    //Serial.println(responseBody);"

    http.end();
    

    }



 }
 
 */



}
